app/controllers/boards_controller.rb

  def show
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @boards = Board.page(params[:page]).per(9)
---
SELECT "boards".* FROM "boards" LIMIT $1 OFFSET $2  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boards"

  def create
    @board = Board.new(board_params)

    @board.grid = GenerateBoard.new(@board.height, @board.width, @board.number_of_mines).call

    if @board.save
---
INSERT INTO "boards" ("email", "name", "height", "width", "number_of_mines", "grid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"